teacupAl/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    xMin    -0.25;
    xMax     0.25;
    yMin     -0.15;
    yMax     0.2;
    zMin    -0.175;
    zMax     0.175;
    xCells  45;
    yCells  29;
    zCells  30;
}

scale   1;

vertices
(
    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)

    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $:backgroundMesh.xCells
        $:backgroundMesh.yCells
        $:backgroundMesh.zCells
    )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
 //Uncomment below to define patches in background mesh
    // left
    // {
    //     type patch;
    //     faces
    //     (
    //         (0 3 7 4)
    //     );
    // }

    // right
    // {
    //     type patch;
    //     faces
    //     (
    //         (1 5 6 2)
    //     );
    // }

    // bottom
    // {
    //     type wall;
    //     faces
    //     (
    //         (0 1 2 3)
    //     );
    // }

    // top
    // {
    //     type wall;
    //     faces
    //     (
    //         (4 7 6 5)
    //     );
    // }

    // back
    // {
    //     type wall;
    //     faces
    //     (
    //         (0 4 5 1)
    //     );
    // }

    // front
    // {
    //     type wall;
    //     faces
    //     (
    //         (3 2 6 7)
    //     );
    // }
);

mergePatchPairs
(
);

// ************************************************************************* //
