teacupAl/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{

    left
    {
      type            fixedValue;
      value           uniform (1.0 0.0 0.0);
    }
    right
    {
      type            pressureInletOutletVelocity;
      value           $internalField;
    }
    front
    {
		  type            noSlip;
    }
    back
    {
		  type            noSlip;
    }
    top
    {
		  type            noSlip;
    }
    bottom
    {
		  type            noSlip;
    }
    fluid_to_cup
    {
		  type            noSlip;
    }
    fluid_to_tea
    {
		  type            noSlip;
    }

}
