teacupAl/0/tea/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0.001 0 0);

boundaryField
{
    tea_to_cup
    {
		    type            fixedValue;
        value           uniform ( 0.001 0 0 );
    }
    tea_to_fluid
    {
		    type            fixedValue;
        value           uniform ( 0.001 0 0 );
    }

}
