teacupAl/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 297.15;

boundaryField
{
    left
    {
      type            	fixedValue;
      value			        uniform 297.15;  //Temperture value
    }
    right
    {
      type            	inletOutlet;
      value           	$internalField;
      inletValue      	$internalField;
    }
    front
    {
		  type            	zeroGradient;
    }
    back
    {
		  type            	zeroGradient;
    }
    top
    {
		  type            	zeroGradient;
    }
    bottom
    {
		  type            	zeroGradient;
    }
    fluid_to_cup
    {
      type            	compressible::turbulentTemperatureRadCoupledMixed;
      Tnbr            	T;
      kappaMethod     	fluidThermo;
      kappa           	kappa;
      value           	$internalField;		//Initial value
    }
    fluid_to_tea
    {
      type            	compressible::turbulentTemperatureRadCoupledMixed;
      Tnbr            	T;
      kappaMethod     	fluidThermo;
      kappa           	kappa;
      value           	$internalField;		//Initial value
    }

}
