teacupAl/0/nSurfaceLayers
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nSurfaceLayers;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
308962
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    back
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    cupbottom
    {
        type            fixedValue;
        value           uniform 0;
    }
    front
    {
        type            fixedValue;
        value           uniform 0;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    cup
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    cup_slave
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    teaToCup
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    teaToCup_slave
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    teaToFluid
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
    teaToFluid_slave
    {
        type            fixedValue;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
