teacupAl/0/tea/G
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    tea_to_cup
    {
      type            MarshakRadiation;
      emissivityMode  lookup;
      emissivity      uniform 0.96; //for air 0.8 & for water 0.96
      value           uniform 0;
    }
    tea_to_fluid
    {
      type            MarshakRadiation;
      emissivityMode  lookup;
      emissivity      uniform 0.96;
      value           uniform 0;
    }
}
