teacupAl/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	"rho.*"
	{
		solver			PCG;
		preconditioner		DIC;
		tolerance		1e-8;
		relTol			1e-2;
	}
    
	"(p|p_rgh|G)"
	{
		solver			GAMG;
		tolerance		1e-6;
		relTol			0.01;
		smoother		DICGaussSeidel;
		minIter			1;
		maxIter			100;
		nPreSweeps		1;
		nPostSweeps		3;
		nFinestSweeps		3;
		scaleCorrection		true; 
		directSolveCoarsest     false; 
		cacheAgglomeration	on; 
		nCellsInCoarsestLevel	50; 
		agglomerator		faceAreaPair; 
		mergeLevels		1;
	}

	p_rghFinal
	{
		$p_rgh;
		relTol			1e-6;
	}

	"(U|h|e|k|epsilon|R|omega)"
	{
		solver			PBiCGStab;
		preconditioner		DILU;
		tolerance		1e-8;
		relTol			1e-2;
	}

	"(U|h|e|k|epsilon|R|omega)Final"
	{
		$U;
		relTol          	1e-6;
	}

	GFinal
	{
		$G;
		relTol          1e-6;
	}
}

/*===================================================================*/

PIMPLE
{
	outerCorrectorResidualControl
	{
		"(U|rho|p_rgh|h|omega|k|epsilon)"
		{
			tolerance     1e-3;
			relTol        1e-6;
		}
	}
	
	residualControl
	{
		U 			1e-5;
		p 			1e-5;
		p_rgh 			1e-3;
		h 			1e-5;
		G 			1e-5;
		"(k|epsilon|omega)" 	1e-5;
	}
}

relaxationFactors
{
	fields
	{
		p               0.2;
	}
	equations
	{
		U               0.4;
		k               0.5;
		epsilon		0.5;
		omega		0.5;
		h		0.5;
		e               0.3;
		".*"            0.5;
	}
}

